{
	"class_name": "Model",
	"config": {
		"name": "model1",
		"layers": [
			{
				"name": "input1",
				"class_name": "InputLayer",
				"config": {
					"batch_input_shape": [
						null,
						60,
						100,
						3
					],
					"dtype": "float32",
					"sparse": false,
					"name": "input1"
				},
				"inbound_nodes": []
			},
			{
				"name": "densenet121",
				"class_name": "Model",
				"config": {
					"name": "densenet121",
					"layers": [
						{
							"name": "input2",
							"class_name": "InputLayer",
							"config": {
								"batch_input_shape": [
									null,
									60,
									100,
									3
								],
								"dtype": "float32",
								"sparse": false,
								"name": "input2"
							},
							"inbound_nodes": []
						},
						{
							"name": "zero_padding2d_ZeroPadding2D1",
							"class_name": "ZeroPadding2D",
							"config": {
								"padding": [
									[
										3,
										3
									],
									[
										3,
										3
									]
								],
								"data_format": "channels_last",
								"name": "zero_padding2d_ZeroPadding2D1",
								"trainable": true
							},
							"inbound_nodes": [
								[
									[
										"input2",
										0,
										0,
										{}
									]
								]
							]
						},
						{
							"name": "conv1/conv",
							"class_name": "Conv2D",
							"config": {
								"filters": 64,
								"kernel_initializer": {
									"class_name": "VarianceScaling",
									"config": {
										"scale": 1,
										"mode": "fan_avg",
										"distribution": "normal",
										"seed": null
									}
								},
								"kernel_regularizer": null,
								"kernel_constraint": null,
								"kernel_size": [
									7,
									7
								],
								"strides": [
									2,
									2
								],
								"padding": "valid",
								"data_format": "channels_last",
								"dilation_rate": [
									1,
									1
								],
								"activation": "linear",
								"use_bias": false,
								"bias_initializer": {
									"class_name": "Zeros",
									"config": {}
								},
								"bias_regularizer": null,
								"activity_regularizer": null,
								"bias_constraint": null,
								"name": "conv1/conv",
								"trainable": true
							},
							"inbound_nodes": [
								[
									[
										"zero_padding2d_ZeroPadding2D1",
										0,
										0,
										{}
									]
								]
							]
						},
						{
							"name": "conv1/bn",
							"class_name": "BatchNormalization",
							"config": {
								"axis": 3,
								"momentum": 0.99,
								"epsilon": 0.00001001,
								"center": true,
								"scale": true,
								"beta_initializer": {
									"class_name": "Zeros",
									"config": {}
								},
								"gamma_initializer": {
									"class_name": "Ones",
									"config": {}
								},
								"moving_mean_initializer": {
									"class_name": "Zeros",
									"config": {}
								},
								"moving_variance_initializer": {
									"class_name": "Ones",
									"config": {}
								},
								"beta_regularizer": null,
								"gamma_regularizer": null,
								"beta_constraint": null,
								"gamma_constraint": null,
								"name": "conv1/bn",
								"trainable": true
							},
							"inbound_nodes": [
								[
									[
										"conv1/conv",
										0,
										0,
										{}
									]
								]
							]
						},
						{
							"name": "conv1/relu",
							"class_name": "Activation",
							"config": {
								"activation": "relu",
								"name": "conv1/relu",
								"trainable": true
							},
							"inbound_nodes": [
								[
									[
										"conv1/bn",
										0,
										0,
										{}
									]
								]
							]
						},
						{
							"name": "zero_padding2d_ZeroPadding2D2",
							"class_name": "ZeroPadding2D",
							"config": {
								"padding": [
									[
										1,
										1
									],
									[
										1,
										1
									]
								],
								"data_format": "channels_last",
								"name": "zero_padding2d_ZeroPadding2D2",
								"trainable": true
							},
							"inbound_nodes": [
								[
									[
										"conv1/relu",
										0,
										0,
										{}
									]
								]
							]
						},
						{
							"name": "pool1",
							"class_name": "MaxPooling2D",
							"config": {
								"pool_size": [
									3,
									3
								],
								"padding": "valid",
								"strides": [
									2,
									2
								],
								"data_format": "channels_last",
								"name": "pool1",
								"trainable": true
							},
							"inbound_nodes": [
								[
									[
										"zero_padding2d_ZeroPadding2D2",
										0,
										0,
										{}
									]
								]
							]
						},
						{
							"name": "conv2_block6_0_bn",
							"class_name": "BatchNormalization",
							"config": {
								"axis": 3,
								"momentum": 0.99,
								"epsilon": 0.00001001,
								"center": true,
								"scale": true,
								"beta_initializer": {
									"class_name": "Zeros",
									"config": {}
								},
								"gamma_initializer": {
									"class_name": "Ones",
									"config": {}
								},
								"moving_mean_initializer": {
									"class_name": "Zeros",
									"config": {}
								},
								"moving_variance_initializer": {
									"class_name": "Ones",
									"config": {}
								},
								"beta_regularizer": null,
								"gamma_regularizer": null,
								"beta_constraint": null,
								"gamma_constraint": null,
								"name": "conv2_block6_0_bn",
								"trainable": true
							},
							"inbound_nodes": [
								[
									[
										"pool1",
										0,
										0,
										{}
									]
								]
							]
						},
						{
							"name": "conv2_block6_0_relu",
							"class_name": "Activation",
							"config": {
								"activation": "relu",
								"name": "conv2_block6_0_relu",
								"trainable": true
							},
							"inbound_nodes": [
								[
									[
										"conv2_block6_0_bn",
										0,
										0,
										{}
									]
								]
							]
						},
						{
							"name": "conv2_block6_1_conv",
							"class_name": "Conv2D",
							"config": {
								"filters": 128,
								"kernel_initializer": {
									"class_name": "VarianceScaling",
									"config": {
										"scale": 1,
										"mode": "fan_avg",
										"distribution": "normal",
										"seed": null
									}
								},
								"kernel_regularizer": null,
								"kernel_constraint": null,
								"kernel_size": [
									1,
									1
								],
								"strides": [
									1,
									1
								],
								"padding": "valid",
								"data_format": "channels_last",
								"dilation_rate": [
									1,
									1
								],
								"activation": "linear",
								"use_bias": true,
								"bias_initializer": {
									"class_name": "Zeros",
									"config": {}
								},
								"bias_regularizer": null,
								"activity_regularizer": null,
								"bias_constraint": null,
								"name": "conv2_block6_1_conv",
								"trainable": true
							},
							"inbound_nodes": [
								[
									[
										"conv2_block6_0_relu",
										0,
										0,
										{}
									]
								]
							]
						},
						{
							"name": "conv2_block6_1_bn",
							"class_name": "BatchNormalization",
							"config": {
								"axis": 3,
								"momentum": 0.99,
								"epsilon": 0.00001001,
								"center": true,
								"scale": true,
								"beta_initializer": {
									"class_name": "Zeros",
									"config": {}
								},
								"gamma_initializer": {
									"class_name": "Ones",
									"config": {}
								},
								"moving_mean_initializer": {
									"class_name": "Zeros",
									"config": {}
								},
								"moving_variance_initializer": {
									"class_name": "Ones",
									"config": {}
								},
								"beta_regularizer": null,
								"gamma_regularizer": null,
								"beta_constraint": null,
								"gamma_constraint": null,
								"name": "conv2_block6_1_bn",
								"trainable": true
							},
							"inbound_nodes": [
								[
									[
										"conv2_block6_1_conv",
										0,
										0,
										{}
									]
								]
							]
						},
						{
							"name": "conv2_block6_1_relu",
							"class_name": "Activation",
							"config": {
								"activation": "relu",
								"name": "conv2_block6_1_relu",
								"trainable": true
							},
							"inbound_nodes": [
								[
									[
										"conv2_block6_1_bn",
										0,
										0,
										{}
									]
								]
							]
						},
						{
							"name": "conv2_block6_2_conv",
							"class_name": "Conv2D",
							"config": {
								"filters": 32,
								"kernel_initializer": {
									"class_name": "VarianceScaling",
									"config": {
										"scale": 1,
										"mode": "fan_avg",
										"distribution": "normal",
										"seed": null
									}
								},
								"kernel_regularizer": null,
								"kernel_constraint": null,
								"kernel_size": [
									3,
									3
								],
								"strides": [
									1,
									1
								],
								"padding": "same",
								"data_format": "channels_last",
								"dilation_rate": [
									1,
									1
								],
								"activation": "linear",
								"use_bias": true,
								"bias_initializer": {
									"class_name": "Zeros",
									"config": {}
								},
								"bias_regularizer": null,
								"activity_regularizer": null,
								"bias_constraint": null,
								"name": "conv2_block6_2_conv",
								"trainable": true
							},
							"inbound_nodes": [
								[
									[
										"conv2_block6_1_relu",
										0,
										0,
										{}
									]
								]
							]
						},
						{
							"name": "conv2_block6_concat",
							"class_name": "Concatenate",
							"config": {
								"axis": 3,
								"name": "conv2_block6_concat",
								"trainable": true
							},
							"inbound_nodes": [
								[
									[
										"pool1",
										0,
										0,
										{}
									],
									[
										"conv2_block6_2_conv",
										0,
										0,
										{}
									]
								]
							]
						},
						{
							"name": "pool2_bn",
							"class_name": "BatchNormalization",
							"config": {
								"axis": 3,
								"momentum": 0.99,
								"epsilon": 0.00001001,
								"center": true,
								"scale": true,
								"beta_initializer": {
									"class_name": "Zeros",
									"config": {}
								},
								"gamma_initializer": {
									"class_name": "Ones",
									"config": {}
								},
								"moving_mean_initializer": {
									"class_name": "Zeros",
									"config": {}
								},
								"moving_variance_initializer": {
									"class_name": "Ones",
									"config": {}
								},
								"beta_regularizer": null,
								"gamma_regularizer": null,
								"beta_constraint": null,
								"gamma_constraint": null,
								"name": "pool2_bn",
								"trainable": true
							},
							"inbound_nodes": [
								[
									[
										"conv2_block6_concat",
										0,
										0,
										{}
									]
								]
							]
						},
						{
							"name": "pool2_relu",
							"class_name": "Activation",
							"config": {
								"activation": "relu",
								"name": "pool2_relu",
								"trainable": true
							},
							"inbound_nodes": [
								[
									[
										"pool2_bn",
										0,
										0,
										{}
									]
								]
							]
						},
						{
							"name": "pool2_conv",
							"class_name": "Conv2D",
							"config": {
								"filters": 48,
								"kernel_initializer": {
									"class_name": "VarianceScaling",
									"config": {
										"scale": 1,
										"mode": "fan_avg",
										"distribution": "normal",
										"seed": null
									}
								},
								"kernel_regularizer": null,
								"kernel_constraint": null,
								"kernel_size": [
									1,
									1
								],
								"strides": [
									1,
									1
								],
								"padding": "valid",
								"data_format": "channels_last",
								"dilation_rate": [
									1,
									1
								],
								"activation": "linear",
								"use_bias": true,
								"bias_initializer": {
									"class_name": "Zeros",
									"config": {}
								},
								"bias_regularizer": null,
								"activity_regularizer": null,
								"bias_constraint": null,
								"name": "pool2_conv",
								"trainable": true
							},
							"inbound_nodes": [
								[
									[
										"pool2_relu",
										0,
										0,
										{}
									]
								]
							]
						},
						{
							"name": "pool2_pool",
							"class_name": "AveragePooling2D",
							"config": {
								"pool_size": [
									2,
									2
								],
								"padding": "valid",
								"strides": [
									2,
									2
								],
								"data_format": "channels_last",
								"name": "pool2_pool",
								"trainable": true
							},
							"inbound_nodes": [
								[
									[
										"pool2_conv",
										0,
										0,
										{}
									]
								]
							]
						},
						{
							"name": "conv3_block12_0_bn",
							"class_name": "BatchNormalization",
							"config": {
								"axis": 3,
								"momentum": 0.99,
								"epsilon": 0.00001001,
								"center": true,
								"scale": true,
								"beta_initializer": {
									"class_name": "Zeros",
									"config": {}
								},
								"gamma_initializer": {
									"class_name": "Ones",
									"config": {}
								},
								"moving_mean_initializer": {
									"class_name": "Zeros",
									"config": {}
								},
								"moving_variance_initializer": {
									"class_name": "Ones",
									"config": {}
								},
								"beta_regularizer": null,
								"gamma_regularizer": null,
								"beta_constraint": null,
								"gamma_constraint": null,
								"name": "conv3_block12_0_bn",
								"trainable": true
							},
							"inbound_nodes": [
								[
									[
										"pool2_pool",
										0,
										0,
										{}
									]
								]
							]
						},
						{
							"name": "conv3_block12_0_relu",
							"class_name": "Activation",
							"config": {
								"activation": "relu",
								"name": "conv3_block12_0_relu",
								"trainable": true
							},
							"inbound_nodes": [
								[
									[
										"conv3_block12_0_bn",
										0,
										0,
										{}
									]
								]
							]
						},
						{
							"name": "conv3_block12_1_conv",
							"class_name": "Conv2D",
							"config": {
								"filters": 128,
								"kernel_initializer": {
									"class_name": "VarianceScaling",
									"config": {
										"scale": 1,
										"mode": "fan_avg",
										"distribution": "normal",
										"seed": null
									}
								},
								"kernel_regularizer": null,
								"kernel_constraint": null,
								"kernel_size": [
									1,
									1
								],
								"strides": [
									1,
									1
								],
								"padding": "valid",
								"data_format": "channels_last",
								"dilation_rate": [
									1,
									1
								],
								"activation": "linear",
								"use_bias": true,
								"bias_initializer": {
									"class_name": "Zeros",
									"config": {}
								},
								"bias_regularizer": null,
								"activity_regularizer": null,
								"bias_constraint": null,
								"name": "conv3_block12_1_conv",
								"trainable": true
							},
							"inbound_nodes": [
								[
									[
										"conv3_block12_0_relu",
										0,
										0,
										{}
									]
								]
							]
						},
						{
							"name": "conv3_block12_1_bn",
							"class_name": "BatchNormalization",
							"config": {
								"axis": 3,
								"momentum": 0.99,
								"epsilon": 0.00001001,
								"center": true,
								"scale": true,
								"beta_initializer": {
									"class_name": "Zeros",
									"config": {}
								},
								"gamma_initializer": {
									"class_name": "Ones",
									"config": {}
								},
								"moving_mean_initializer": {
									"class_name": "Zeros",
									"config": {}
								},
								"moving_variance_initializer": {
									"class_name": "Ones",
									"config": {}
								},
								"beta_regularizer": null,
								"gamma_regularizer": null,
								"beta_constraint": null,
								"gamma_constraint": null,
								"name": "conv3_block12_1_bn",
								"trainable": true
							},
							"inbound_nodes": [
								[
									[
										"conv3_block12_1_conv",
										0,
										0,
										{}
									]
								]
							]
						},
						{
							"name": "conv3_block12_1_relu",
							"class_name": "Activation",
							"config": {
								"activation": "relu",
								"name": "conv3_block12_1_relu",
								"trainable": true
							},
							"inbound_nodes": [
								[
									[
										"conv3_block12_1_bn",
										0,
										0,
										{}
									]
								]
							]
						},
						{
							"name": "conv3_block12_2_conv",
							"class_name": "Conv2D",
							"config": {
								"filters": 32,
								"kernel_initializer": {
									"class_name": "VarianceScaling",
									"config": {
										"scale": 1,
										"mode": "fan_avg",
										"distribution": "normal",
										"seed": null
									}
								},
								"kernel_regularizer": null,
								"kernel_constraint": null,
								"kernel_size": [
									3,
									3
								],
								"strides": [
									1,
									1
								],
								"padding": "same",
								"data_format": "channels_last",
								"dilation_rate": [
									1,
									1
								],
								"activation": "linear",
								"use_bias": true,
								"bias_initializer": {
									"class_name": "Zeros",
									"config": {}
								},
								"bias_regularizer": null,
								"activity_regularizer": null,
								"bias_constraint": null,
								"name": "conv3_block12_2_conv",
								"trainable": true
							},
							"inbound_nodes": [
								[
									[
										"conv3_block12_1_relu",
										0,
										0,
										{}
									]
								]
							]
						},
						{
							"name": "conv3_block12_concat",
							"class_name": "Concatenate",
							"config": {
								"axis": 3,
								"name": "conv3_block12_concat",
								"trainable": true
							},
							"inbound_nodes": [
								[
									[
										"pool2_pool",
										0,
										0,
										{}
									],
									[
										"conv3_block12_2_conv",
										0,
										0,
										{}
									]
								]
							]
						},
						{
							"name": "pool3_bn",
							"class_name": "BatchNormalization",
							"config": {
								"axis": 3,
								"momentum": 0.99,
								"epsilon": 0.00001001,
								"center": true,
								"scale": true,
								"beta_initializer": {
									"class_name": "Zeros",
									"config": {}
								},
								"gamma_initializer": {
									"class_name": "Ones",
									"config": {}
								},
								"moving_mean_initializer": {
									"class_name": "Zeros",
									"config": {}
								},
								"moving_variance_initializer": {
									"class_name": "Ones",
									"config": {}
								},
								"beta_regularizer": null,
								"gamma_regularizer": null,
								"beta_constraint": null,
								"gamma_constraint": null,
								"name": "pool3_bn",
								"trainable": true
							},
							"inbound_nodes": [
								[
									[
										"conv3_block12_concat",
										0,
										0,
										{}
									]
								]
							]
						},
						{
							"name": "pool3_relu",
							"class_name": "Activation",
							"config": {
								"activation": "relu",
								"name": "pool3_relu",
								"trainable": true
							},
							"inbound_nodes": [
								[
									[
										"pool3_bn",
										0,
										0,
										{}
									]
								]
							]
						},
						{
							"name": "pool3_conv",
							"class_name": "Conv2D",
							"config": {
								"filters": 40,
								"kernel_initializer": {
									"class_name": "VarianceScaling",
									"config": {
										"scale": 1,
										"mode": "fan_avg",
										"distribution": "normal",
										"seed": null
									}
								},
								"kernel_regularizer": null,
								"kernel_constraint": null,
								"kernel_size": [
									1,
									1
								],
								"strides": [
									1,
									1
								],
								"padding": "valid",
								"data_format": "channels_last",
								"dilation_rate": [
									1,
									1
								],
								"activation": "linear",
								"use_bias": true,
								"bias_initializer": {
									"class_name": "Zeros",
									"config": {}
								},
								"bias_regularizer": null,
								"activity_regularizer": null,
								"bias_constraint": null,
								"name": "pool3_conv",
								"trainable": true
							},
							"inbound_nodes": [
								[
									[
										"pool3_relu",
										0,
										0,
										{}
									]
								]
							]
						},
						{
							"name": "pool3_pool",
							"class_name": "AveragePooling2D",
							"config": {
								"pool_size": [
									2,
									2
								],
								"padding": "valid",
								"strides": [
									2,
									2
								],
								"data_format": "channels_last",
								"name": "pool3_pool",
								"trainable": true
							},
							"inbound_nodes": [
								[
									[
										"pool3_conv",
										0,
										0,
										{}
									]
								]
							]
						},
						{
							"name": "conv4_block24_0_bn",
							"class_name": "BatchNormalization",
							"config": {
								"axis": 3,
								"momentum": 0.99,
								"epsilon": 0.00001001,
								"center": true,
								"scale": true,
								"beta_initializer": {
									"class_name": "Zeros",
									"config": {}
								},
								"gamma_initializer": {
									"class_name": "Ones",
									"config": {}
								},
								"moving_mean_initializer": {
									"class_name": "Zeros",
									"config": {}
								},
								"moving_variance_initializer": {
									"class_name": "Ones",
									"config": {}
								},
								"beta_regularizer": null,
								"gamma_regularizer": null,
								"beta_constraint": null,
								"gamma_constraint": null,
								"name": "conv4_block24_0_bn",
								"trainable": true
							},
							"inbound_nodes": [
								[
									[
										"pool3_pool",
										0,
										0,
										{}
									]
								]
							]
						},
						{
							"name": "conv4_block24_0_relu",
							"class_name": "Activation",
							"config": {
								"activation": "relu",
								"name": "conv4_block24_0_relu",
								"trainable": true
							},
							"inbound_nodes": [
								[
									[
										"conv4_block24_0_bn",
										0,
										0,
										{}
									]
								]
							]
						},
						{
							"name": "conv4_block24_1_conv",
							"class_name": "Conv2D",
							"config": {
								"filters": 128,
								"kernel_initializer": {
									"class_name": "VarianceScaling",
									"config": {
										"scale": 1,
										"mode": "fan_avg",
										"distribution": "normal",
										"seed": null
									}
								},
								"kernel_regularizer": null,
								"kernel_constraint": null,
								"kernel_size": [
									1,
									1
								],
								"strides": [
									1,
									1
								],
								"padding": "valid",
								"data_format": "channels_last",
								"dilation_rate": [
									1,
									1
								],
								"activation": "linear",
								"use_bias": true,
								"bias_initializer": {
									"class_name": "Zeros",
									"config": {}
								},
								"bias_regularizer": null,
								"activity_regularizer": null,
								"bias_constraint": null,
								"name": "conv4_block24_1_conv",
								"trainable": true
							},
							"inbound_nodes": [
								[
									[
										"conv4_block24_0_relu",
										0,
										0,
										{}
									]
								]
							]
						},
						{
							"name": "conv4_block24_1_bn",
							"class_name": "BatchNormalization",
							"config": {
								"axis": 3,
								"momentum": 0.99,
								"epsilon": 0.00001001,
								"center": true,
								"scale": true,
								"beta_initializer": {
									"class_name": "Zeros",
									"config": {}
								},
								"gamma_initializer": {
									"class_name": "Ones",
									"config": {}
								},
								"moving_mean_initializer": {
									"class_name": "Zeros",
									"config": {}
								},
								"moving_variance_initializer": {
									"class_name": "Ones",
									"config": {}
								},
								"beta_regularizer": null,
								"gamma_regularizer": null,
								"beta_constraint": null,
								"gamma_constraint": null,
								"name": "conv4_block24_1_bn",
								"trainable": true
							},
							"inbound_nodes": [
								[
									[
										"conv4_block24_1_conv",
										0,
										0,
										{}
									]
								]
							]
						},
						{
							"name": "conv4_block24_1_relu",
							"class_name": "Activation",
							"config": {
								"activation": "relu",
								"name": "conv4_block24_1_relu",
								"trainable": true
							},
							"inbound_nodes": [
								[
									[
										"conv4_block24_1_bn",
										0,
										0,
										{}
									]
								]
							]
						},
						{
							"name": "conv4_block24_2_conv",
							"class_name": "Conv2D",
							"config": {
								"filters": 32,
								"kernel_initializer": {
									"class_name": "VarianceScaling",
									"config": {
										"scale": 1,
										"mode": "fan_avg",
										"distribution": "normal",
										"seed": null
									}
								},
								"kernel_regularizer": null,
								"kernel_constraint": null,
								"kernel_size": [
									3,
									3
								],
								"strides": [
									1,
									1
								],
								"padding": "same",
								"data_format": "channels_last",
								"dilation_rate": [
									1,
									1
								],
								"activation": "linear",
								"use_bias": true,
								"bias_initializer": {
									"class_name": "Zeros",
									"config": {}
								},
								"bias_regularizer": null,
								"activity_regularizer": null,
								"bias_constraint": null,
								"name": "conv4_block24_2_conv",
								"trainable": true
							},
							"inbound_nodes": [
								[
									[
										"conv4_block24_1_relu",
										0,
										0,
										{}
									]
								]
							]
						},
						{
							"name": "conv4_block24_concat",
							"class_name": "Concatenate",
							"config": {
								"axis": 3,
								"name": "conv4_block24_concat",
								"trainable": true
							},
							"inbound_nodes": [
								[
									[
										"pool3_pool",
										0,
										0,
										{}
									],
									[
										"conv4_block24_2_conv",
										0,
										0,
										{}
									]
								]
							]
						},
						{
							"name": "pool4_bn",
							"class_name": "BatchNormalization",
							"config": {
								"axis": 3,
								"momentum": 0.99,
								"epsilon": 0.00001001,
								"center": true,
								"scale": true,
								"beta_initializer": {
									"class_name": "Zeros",
									"config": {}
								},
								"gamma_initializer": {
									"class_name": "Ones",
									"config": {}
								},
								"moving_mean_initializer": {
									"class_name": "Zeros",
									"config": {}
								},
								"moving_variance_initializer": {
									"class_name": "Ones",
									"config": {}
								},
								"beta_regularizer": null,
								"gamma_regularizer": null,
								"beta_constraint": null,
								"gamma_constraint": null,
								"name": "pool4_bn",
								"trainable": true
							},
							"inbound_nodes": [
								[
									[
										"conv4_block24_concat",
										0,
										0,
										{}
									]
								]
							]
						},
						{
							"name": "pool4_relu",
							"class_name": "Activation",
							"config": {
								"activation": "relu",
								"name": "pool4_relu",
								"trainable": true
							},
							"inbound_nodes": [
								[
									[
										"pool4_bn",
										0,
										0,
										{}
									]
								]
							]
						},
						{
							"name": "pool4_conv",
							"class_name": "Conv2D",
							"config": {
								"filters": 36,
								"kernel_initializer": {
									"class_name": "VarianceScaling",
									"config": {
										"scale": 1,
										"mode": "fan_avg",
										"distribution": "normal",
										"seed": null
									}
								},
								"kernel_regularizer": null,
								"kernel_constraint": null,
								"kernel_size": [
									1,
									1
								],
								"strides": [
									1,
									1
								],
								"padding": "valid",
								"data_format": "channels_last",
								"dilation_rate": [
									1,
									1
								],
								"activation": "linear",
								"use_bias": true,
								"bias_initializer": {
									"class_name": "Zeros",
									"config": {}
								},
								"bias_regularizer": null,
								"activity_regularizer": null,
								"bias_constraint": null,
								"name": "pool4_conv",
								"trainable": true
							},
							"inbound_nodes": [
								[
									[
										"pool4_relu",
										0,
										0,
										{}
									]
								]
							]
						},
						{
							"name": "pool4_pool",
							"class_name": "AveragePooling2D",
							"config": {
								"pool_size": [
									2,
									2
								],
								"padding": "valid",
								"strides": [
									2,
									2
								],
								"data_format": "channels_last",
								"name": "pool4_pool",
								"trainable": true
							},
							"inbound_nodes": [
								[
									[
										"pool4_conv",
										0,
										0,
										{}
									]
								]
							]
						},
						{
							"name": "conv5_block16_0_bn",
							"class_name": "BatchNormalization",
							"config": {
								"axis": 3,
								"momentum": 0.99,
								"epsilon": 0.00001001,
								"center": true,
								"scale": true,
								"beta_initializer": {
									"class_name": "Zeros",
									"config": {}
								},
								"gamma_initializer": {
									"class_name": "Ones",
									"config": {}
								},
								"moving_mean_initializer": {
									"class_name": "Zeros",
									"config": {}
								},
								"moving_variance_initializer": {
									"class_name": "Ones",
									"config": {}
								},
								"beta_regularizer": null,
								"gamma_regularizer": null,
								"beta_constraint": null,
								"gamma_constraint": null,
								"name": "conv5_block16_0_bn",
								"trainable": true
							},
							"inbound_nodes": [
								[
									[
										"pool4_pool",
										0,
										0,
										{}
									]
								]
							]
						},
						{
							"name": "conv5_block16_0_relu",
							"class_name": "Activation",
							"config": {
								"activation": "relu",
								"name": "conv5_block16_0_relu",
								"trainable": true
							},
							"inbound_nodes": [
								[
									[
										"conv5_block16_0_bn",
										0,
										0,
										{}
									]
								]
							]
						},
						{
							"name": "conv5_block16_1_conv",
							"class_name": "Conv2D",
							"config": {
								"filters": 128,
								"kernel_initializer": {
									"class_name": "VarianceScaling",
									"config": {
										"scale": 1,
										"mode": "fan_avg",
										"distribution": "normal",
										"seed": null
									}
								},
								"kernel_regularizer": null,
								"kernel_constraint": null,
								"kernel_size": [
									1,
									1
								],
								"strides": [
									1,
									1
								],
								"padding": "valid",
								"data_format": "channels_last",
								"dilation_rate": [
									1,
									1
								],
								"activation": "linear",
								"use_bias": true,
								"bias_initializer": {
									"class_name": "Zeros",
									"config": {}
								},
								"bias_regularizer": null,
								"activity_regularizer": null,
								"bias_constraint": null,
								"name": "conv5_block16_1_conv",
								"trainable": true
							},
							"inbound_nodes": [
								[
									[
										"conv5_block16_0_relu",
										0,
										0,
										{}
									]
								]
							]
						},
						{
							"name": "conv5_block16_1_bn",
							"class_name": "BatchNormalization",
							"config": {
								"axis": 3,
								"momentum": 0.99,
								"epsilon": 0.00001001,
								"center": true,
								"scale": true,
								"beta_initializer": {
									"class_name": "Zeros",
									"config": {}
								},
								"gamma_initializer": {
									"class_name": "Ones",
									"config": {}
								},
								"moving_mean_initializer": {
									"class_name": "Zeros",
									"config": {}
								},
								"moving_variance_initializer": {
									"class_name": "Ones",
									"config": {}
								},
								"beta_regularizer": null,
								"gamma_regularizer": null,
								"beta_constraint": null,
								"gamma_constraint": null,
								"name": "conv5_block16_1_bn",
								"trainable": true
							},
							"inbound_nodes": [
								[
									[
										"conv5_block16_1_conv",
										0,
										0,
										{}
									]
								]
							]
						},
						{
							"name": "conv5_block16_1_relu",
							"class_name": "Activation",
							"config": {
								"activation": "relu",
								"name": "conv5_block16_1_relu",
								"trainable": true
							},
							"inbound_nodes": [
								[
									[
										"conv5_block16_1_bn",
										0,
										0,
										{}
									]
								]
							]
						},
						{
							"name": "conv5_block16_2_conv",
							"class_name": "Conv2D",
							"config": {
								"filters": 32,
								"kernel_initializer": {
									"class_name": "VarianceScaling",
									"config": {
										"scale": 1,
										"mode": "fan_avg",
										"distribution": "normal",
										"seed": null
									}
								},
								"kernel_regularizer": null,
								"kernel_constraint": null,
								"kernel_size": [
									3,
									3
								],
								"strides": [
									1,
									1
								],
								"padding": "same",
								"data_format": "channels_last",
								"dilation_rate": [
									1,
									1
								],
								"activation": "linear",
								"use_bias": true,
								"bias_initializer": {
									"class_name": "Zeros",
									"config": {}
								},
								"bias_regularizer": null,
								"activity_regularizer": null,
								"bias_constraint": null,
								"name": "conv5_block16_2_conv",
								"trainable": true
							},
							"inbound_nodes": [
								[
									[
										"conv5_block16_1_relu",
										0,
										0,
										{}
									]
								]
							]
						},
						{
							"name": "conv5_block16_concat",
							"class_name": "Concatenate",
							"config": {
								"axis": 3,
								"name": "conv5_block16_concat",
								"trainable": true
							},
							"inbound_nodes": [
								[
									[
										"pool4_pool",
										0,
										0,
										{}
									],
									[
										"conv5_block16_2_conv",
										0,
										0,
										{}
									]
								]
							]
						},
						{
							"name": "bn",
							"class_name": "BatchNormalization",
							"config": {
								"axis": 3,
								"momentum": 0.99,
								"epsilon": 0.00001001,
								"center": true,
								"scale": true,
								"beta_initializer": {
									"class_name": "Zeros",
									"config": {}
								},
								"gamma_initializer": {
									"class_name": "Ones",
									"config": {}
								},
								"moving_mean_initializer": {
									"class_name": "Zeros",
									"config": {}
								},
								"moving_variance_initializer": {
									"class_name": "Ones",
									"config": {}
								},
								"beta_regularizer": null,
								"gamma_regularizer": null,
								"beta_constraint": null,
								"gamma_constraint": null,
								"name": "bn",
								"trainable": true
							},
							"inbound_nodes": [
								[
									[
										"conv5_block16_concat",
										0,
										0,
										{}
									]
								]
							]
						},
						{
							"name": "relu",
							"class_name": "Activation",
							"config": {
								"activation": "relu",
								"name": "relu",
								"trainable": true
							},
							"inbound_nodes": [
								[
									[
										"bn",
										0,
										0,
										{}
									]
								]
							]
						}
					],
					"input_layers": [
						[
							"input2",
							0,
							0
						]
					],
					"output_layers": [
						[
							"relu",
							0,
							0
						]
					]
				},
				"inbound_nodes": [
					[
						[
							"input1",
							0,
							0,
							{}
						]
					]
				]
			},
			{
				"name": "Reshape",
				"class_name": "Reshape",
				"config": {
					"target_shape": [
						24,
						128
					],
					"name": "Reshape",
					"trainable": true
				},
				"inbound_nodes": [
					[
						[
							"densenet121",
							1,
							0,
							{}
						]
					]
				]
			},
			{
				"name": "Bidirectional",
				"class_name": "Bidirectional",
				"config": {
					"merge_mode": "concat",
					"layer": {
						"class_name": "GRU",
						"config": {
							"name": "GRU",
							"trainable": true,
							"units": 256,
							"activation": "tanh",
							"recurrent_activation": "sigmoid",
							"use_bias": true,
							"kernel_initializer": {
								"class_name": "VarianceScaling",
								"config": {
									"scale": 1,
									"mode": "fan_avg",
									"distribution": "normal",
									"seed": null
								}
							},
							"recurrent_initializer": {
								"class_name": "Orthogonal",
								"config": {
									"gain": 1,
									"seed": null
								}
							},
							"bias_initializer": {
								"class_name": "Zeros",
								"config": {}
							},
							"kernel_regularizer": null,
							"recurrent_regularizer": null,
							"bias_regularizer": null,
							"activity_regularizer": null,
							"kernel_constraint": null,
							"recurrent_constraint": null,
							"bias_constraint": null,
							"dropout": 0.20000000298023224,
							"recurrent_dropout": 0,
							"implementation": null,
							"reset_after": false,
							"return_sequences": true,
							"return_state": false,
							"go_backwards": false,
							"stateful": false,
							"unroll": false
						}
					},
					"name": "Bidirectional",
					"trainable": true
				},
				"inbound_nodes": [
					[
						[
							"Reshape",
							0,
							0,
							{}
						]
					]
				]
			},
			{
				"name": "Dense_2",
				"class_name": "Dense",
				"config": {
					"units": 42,
					"activation": "softmax",
					"use_bias": true,
					"kernel_initializer": {
						"class_name": "VarianceScaling",
						"config": {
							"scale": 1,
							"mode": "fan_avg",
							"distribution": "normal",
							"seed": null
						}
					},
					"bias_initializer": {
						"class_name": "Zeros",
						"config": {}
					},
					"kernel_regularizer": null,
					"bias_regularizer": null,
					"activity_regularizer": null,
					"kernel_constraint": null,
					"bias_constraint": null,
					"name": "Dense_2",
					"trainable": true
				},
				"inbound_nodes": [
					[
						[
							"Bidirectional",
							0,
							0,
							{}
						]
					]
				]
			}
		],
		"input_layers": [
			[
				"input1",
				0,
				0
			]
		],
		"output_layers": [
			[
				"Dense_2",
				0,
				0
			]
		]
	},
	"keras_version": "tfjs-layers 3.0.0",
	"backend": "tensor_flow.js"
}
